NamJeongkuk/ref_main/src/psoc6/Hardware/Hardware.c
/*!
 * @file
 * @brief
 *
 * Copyright GE Appliances - Confidential - All rights reserved.
 */

#include <stdint.h>
#include "Hardware.h"
#include "Clock.h"
#include "Crc16Calculator_Table.h"
#include "DataModelErdPointerAccess.h"
#include "Header.h"
#include "I_Interrupt.h"
#include "SystemErds.h"
#include "BufferedUart_Scb0.h"
#include "BufferedUart_Scb5.h"
#include "Action_Psoc6SystemReset.h"
#include "cy_pdl.h"

void Hardware_InitializeStage1(void)
{
   Clock_Init();

   __enable_irq();
}

void Hardware_InitializeStage2(I_DataModel_t *dataModel)
{
   I_BufferedUart_t *internalUart = BufferedUart_Scb0_Init();
   DataModelErdPointerAccess_Write(dataModel, Erd_InternalBufferedUart, internalUart);

   I_BufferedUart_t *externalUart = BufferedUart_Scb5_Init();
   DataModelErdPointerAccess_Write(dataModel, Erd_ExternalBufferedUart, externalUart);

   I_Crc16Calculator_t *crcCalcTable = Crc16Calculator_Table;
   DataModelErdPointerAccess_Write(dataModel, Erd_CrcCalcTable, crcCalcTable);

   DataModelErdPointerAccess_Write(dataModel, Erd_JumpToBootLoaderAction, Header_GetEnterBootLoaderAction());
   DataModelErdPointerAccess_Write(dataModel, Erd_SystemResetAction, Action_Psoc6SystemReset_Init());
}
